* Init stuff
#+BEGIN_SRC emacs-lisp
  (setq initial-buffer-choice (lambda () (dired "~/org")))
  (org-babel-do-load-languages
      'org-babel-load-languages
          '((shell . t)
            (emacs-lisp . t)
            (calc . t)
            (lua . t)))
  (load-theme 'monokai t)
  (show-paren-mode 1)
  (server-force-delete)
  (server-start)
  (display-time)
  (setq browse-url-browser-function 'browse-url-generic
        browse-url-generic-program "google-chrome")
  (setq ido-separator "\n")
  (add-to-list 'load-path "~/.emacs.d/elisp/")
#+END_SRC

#+RESULTS:
| /home/jose/.emacs.d/elpa/slime-20180923.1848/contrib | ~/.emacs.d/elisp/ | /home/jose/.emacs.d/elpa/beacon-20181008.1350 | /home/jose/.emacs.d/elpa/company-20181012.2220 | /home/jose/.emacs.d/elpa/edit-server-20180120.1552 | /home/jose/.emacs.d/elpa/emmet-mode-20180613.341 | /home/jose/.emacs.d/elpa/evil-org-20180323.1606 | /home/jose/.emacs.d/elpa/evil-surround-20180102.1401 | /home/jose/.emacs.d/elpa/evil-20180517.1300 | /home/jose/.emacs.d/elpa/expand-region-20180817.1134 | /home/jose/.emacs.d/elpa/free-keys-20160726.2050 | /home/jose/.emacs.d/elpa/gnuplot-mode-20171013.1616 | /home/jose/.emacs.d/elpa/google-this-20170810.1215 | /home/jose/.emacs.d/elpa/goto-chg-20180105.1033 | /home/jose/.emacs.d/elpa/helm-20180906.517 | /home/jose/.emacs.d/elpa/helm-core-20180826.515 | /home/jose/.emacs.d/elpa/htmlize-20180923.1829 | /home/jose/.emacs.d/elpa/key-seq-20150907.56 | /home/jose/.emacs.d/elpa/key-chord-20160227.438 | /home/jose/.emacs.d/elpa/lua-mode-20180323.1021 | /home/jose/.emacs.d/elpa/magit-20181023.1346 | /home/jose/.emacs.d/elpa/git-commit-20181009.1840 | /home/jose/.emacs.d/elpa/ghub-20181003.1456 | /home/jose/.emacs.d/elpa/let-alist-1.0.5 | /home/jose/.emacs.d/elpa/graphql-20180912.31 | /home/jose/.emacs.d/elpa/magit-popup-20181003.921 | /home/jose/.emacs.d/elpa/dash-20180910.1856 | /home/jose/.emacs.d/elpa/monokai-theme-20180730.1329 | /home/jose/.emacs.d/elpa/ob-mermaid-20180522.1659 | /home/jose/.emacs.d/elpa/org-brain-20180712.1410 | /home/jose/.emacs.d/elpa/org-9.1.13 | /home/jose/.emacs.d/elpa/org-bullets-20171127.526 | /home/jose/.emacs.d/elpa/org-protocol-jekyll-20170328.1639 | /home/jose/.emacs.d/elpa/popup-kill-ring-20131020.1854 | /home/jose/.emacs.d/elpa/popup-20160709.1429 | /home/jose/.emacs.d/elpa/pos-tip-20150318.1513 | /home/jose/.emacs.d/elpa/pymacs-0.25 | /home/jose/.emacs.d/elpa/rainbow-delimiters-20170929.1132 | /home/jose/.emacs.d/elpa/ranger-20170817.1557 | /home/jose/.emacs.d/elpa/seq-2.20 | /home/jose/.emacs.d/elpa/slime-20180923.1848 | /home/jose/.emacs.d/elpa/macrostep-20161120.2106 | /home/jose/.emacs.d/elpa/swiper-20181008.1731 | /home/jose/.emacs.d/elpa/ivy-20181016.730 | /home/jose/.emacs.d/elpa/switch-window-20181012.121 | /home/jose/.emacs.d/elpa/tablist-20170220.335 | /home/jose/.emacs.d/elpa/treepy-20180724.656 | /home/jose/.emacs.d/elpa/undo-tree-0.6.5 | /home/jose/.emacs.d/elpa/use-package-20180715.1801 | /home/jose/.emacs.d/elpa/bind-key-20180513.430 | /home/jose/.emacs.d/elpa/w3m-20180405.520 | /home/jose/.emacs.d/elpa/which-key-20180621.1938 | /home/jose/.emacs.d/elpa/with-editor-20181009.1813 | /home/jose/.emacs.d/elpa/async-20180527.1730 | /home/jose/.emacs.d/elpa/xah-fly-keys-20180911.532 | /home/jose/.emacs.d/elpa/zzz-to-char-20180101.619 | /home/jose/.emacs.d/elpa/avy-20181009.1648 | /etc/emacs25 | /etc/emacs | /usr/local/share/emacs/25.2/site-lisp | /usr/local/share/emacs/site-lisp | /usr/share/emacs25/site-lisp/dictionaries-common | /usr/share/emacs/site-lisp/autoconf | /usr/share/emacs/25.2/site-lisp | /usr/share/emacs/25.2/site-lisp/dictionaries-common | /usr/share/emacs/25.2/site-lisp/elpa | /usr/share/emacs/25.2/site-lisp/pymacs | /usr/share/emacs/25.2/site-lisp/elpa/notmuch-0.25.1 | /usr/share/emacs/site-lisp | /usr/share/emacs/25.2/lisp | /usr/share/emacs/25.2/lisp/vc | /usr/share/emacs/25.2/lisp/url | /usr/share/emacs/25.2/lisp/textmodes | /usr/share/emacs/25.2/lisp/progmodes | /usr/share/emacs/25.2/lisp/play | /usr/share/emacs/25.2/lisp/org | /usr/share/emacs/25.2/lisp/nxml | /usr/share/emacs/25.2/lisp/net | /usr/share/emacs/25.2/lisp/mh-e | /usr/share/emacs/25.2/lisp/mail | /usr/share/emacs/25.2/lisp/leim | /usr/share/emacs/25.2/lisp/language | /usr/share/emacs/25.2/lisp/international | /usr/share/emacs/25.2/lisp/gnus | /usr/share/emacs/25.2/lisp/eshell | /usr/share/emacs/25.2/lisp/erc | /usr/share/emacs/25.2/lisp/emulation | /usr/share/emacs/25.2/lisp/emacs-lisp | /usr/share/emacs/25.2/lisp/cedet | /usr/share/emacs/25.2/lisp/calendar | /usr/share/emacs/25.2/lisp/calc | /usr/share/emacs/25.2/lisp/obsolete |

* Tide-mode
#+BEGIN_SRC emacs-lisp
(use-package tide
  :ensure t
  :after (typescript-mode company flycheck)
  :hook ((typescript-mode . tide-setup)
         (typescript-mode . tide-hl-identifier-mode)
         (before-save . tide-format-before-save)))
#+END_SRC

#+RESULTS:
| tide-format-before-save |
